fio_test_res2_write/128_128k.txt
test: (g=0): rw=randwrite, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=spdk, iodepth=128
fio-3.40-34-g306d8
Starting 1 thread
EAL: No legacy callbacks, legacy socket not created

test: (groupid=0, jobs=1): err= 0: pid=80862: Thu Aug 14 19:55:08 2025
  write: IOPS=21.6k, BW=2700MiB/s (2831MB/s)(26.4GiB/10009msec); 0 zone resets
    slat (nsec): min=1447, max=83296, avg=9360.95, stdev=2700.21
    clat (usec): min=45, max=16477, avg=5914.36, stdev=4615.11
     lat (usec): min=46, max=16488, avg=5923.72, stdev=4615.11
    clat percentiles (usec):
     |  1.00th=[   51],  5.00th=[  114], 10.00th=[  200], 20.00th=[  619],
     | 30.00th=[ 1631], 40.00th=[ 3064], 50.00th=[ 5866], 60.00th=[ 8586],
     | 70.00th=[10028], 80.00th=[10814], 90.00th=[11731], 95.00th=[12387],
     | 99.00th=[13435], 99.50th=[13698], 99.90th=[14484], 99.95th=[14877],
     | 99.99th=[15795]
   bw (  MiB/s): min=   31, max= 2826, per=95.32%, avg=2573.85, stdev=586.55, samples=21
   iops        : min=  254, max=22614, avg=20590.76, stdev=4692.38, samples=21
  lat (usec)   : 50=0.95%, 100=3.38%, 250=8.03%, 500=5.83%, 750=3.51%
  lat (usec)   : 1000=2.75%
  lat (msec)   : 2=8.26%, 4=12.08%, 10=25.52%, 20=29.70%
  cpu          : usr=99.96%, sys=0.03%, ctx=7, majf=0, minf=0
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,216203,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=2700MiB/s (2831MB/s), 2700MiB/s-2700MiB/s (2831MB/s-2831MB/s), io=26.4GiB (28.3GB), run=10009-10009msec