fio_test_res2_write/16_128k.txt
test: (g=0): rw=randwrite, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=spdk, iodepth=16
fio-3.40-34-g306d8
Starting 1 thread
EAL: No legacy callbacks, legacy socket not created

test: (groupid=0, jobs=1): err= 0: pid=60347: Thu Aug 14 19:49:35 2025
  write: IOPS=21.3k, BW=2666MiB/s (2796MB/s)(26.0GiB/10002msec); 0 zone resets
    slat (nsec): min=1503, max=32809, avg=3308.06, stdev=914.85
    clat (usec): min=45, max=3365, avg=746.10, stdev=525.95
     lat (usec): min=46, max=3368, avg=749.40, stdev=525.94
    clat percentiles (usec):
     |  1.00th=[   46],  5.00th=[   84], 10.00th=[  116], 20.00th=[  202],
     | 30.00th=[  322], 40.00th=[  486], 50.00th=[  717], 60.00th=[  914],
     | 70.00th=[ 1057], 80.00th=[ 1188], 90.00th=[ 1434], 95.00th=[ 1680],
     | 99.00th=[ 2114], 99.50th=[ 2278], 99.90th=[ 2540], 99.95th=[ 2671],
     | 99.99th=[ 3097]
   bw (  MiB/s): min= 2488, max= 2816, per=100.00%, avg=2667.01, stdev=86.90, samples=20
   iops        : min=19910, max=22534, avg=21336.20, stdev=695.32, samples=20
  lat (usec)   : 50=1.70%, 100=6.75%, 250=16.76%, 500=15.33%, 750=11.26%
  lat (usec)   : 1000=14.14%
  lat (msec)   : 2=32.48%, 4=1.60%
  cpu          : usr=99.97%, sys=0.01%, ctx=5, majf=0, minf=0
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,213362,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=2666MiB/s (2796MB/s), 2666MiB/s-2666MiB/s (2796MB/s-2796MB/s), io=26.0GiB (28.0GB), run=10002-10002msec