fio_test_res2_write/16_16k.txt
test: (g=0): rw=randwrite, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=spdk, iodepth=16
fio-3.40-34-g306d8
Starting 1 thread
EAL: No legacy callbacks, legacy socket not created

test: (groupid=0, jobs=1): err= 0: pid=56728: Thu Aug 14 19:48:53 2025
  write: IOPS=171k, BW=2673MiB/s (2803MB/s)(26.1GiB/10001msec); 0 zone resets
    slat (nsec): min=245, max=654350, avg=505.18, stdev=526.86
    clat (usec): min=9, max=1910, avg=92.51, stdev=62.76
     lat (usec): min=9, max=1911, avg=93.02, stdev=62.77
    clat percentiles (usec):
     |  1.00th=[   14],  5.00th=[   22], 10.00th=[   30], 20.00th=[   50],
     | 30.00th=[   63], 40.00th=[   75], 50.00th=[   84], 60.00th=[   95],
     | 70.00th=[  105], 80.00th=[  118], 90.00th=[  145], 95.00th=[  204],
     | 99.00th=[  347], 99.50th=[  408], 99.90th=[  553], 99.95th=[  635],
     | 99.99th=[  824]
   bw (  MiB/s): min= 2532, max= 2780, per=100.00%, avg=2673.30, stdev=74.02, samples=20
   iops        : min=162056, max=177974, avg=171090.90, stdev=4737.12, samples=20
  lat (usec)   : 10=0.34%, 20=3.48%, 50=16.99%, 100=44.15%, 250=31.98%
  lat (usec)   : 500=2.88%, 750=0.15%, 1000=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=99.96%, sys=0.01%, ctx=7, majf=0, minf=2
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1710909,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=2673MiB/s (2803MB/s), 2673MiB/s-2673MiB/s (2803MB/s-2803MB/s), io=26.1GiB (28.0GB), run=10001-10001msec