fio_test_res2_write/1_16k.txt
test: (g=0): rw=randwrite, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=spdk, iodepth=1
fio-3.40-34-g306d8
Starting 1 thread
EAL: No legacy callbacks, legacy socket not created

test: (groupid=0, jobs=1): err= 0: pid=50468: Thu Aug 14 19:47:02 2025
  write: IOPS=79.2k, BW=1237MiB/s (1297MB/s)(12.1GiB/10000msec); 0 zone resets
    slat (nsec): min=247, max=24446, avg=383.51, stdev=92.35
    clat (usec): min=8, max=773, avg=11.85, stdev=12.47
     lat (usec): min=9, max=773, avg=12.23, stdev=12.47
    clat percentiles (usec):
     |  1.00th=[   10],  5.00th=[   10], 10.00th=[   10], 20.00th=[   10],
     | 30.00th=[   10], 40.00th=[   10], 50.00th=[   10], 60.00th=[   10],
     | 70.00th=[   10], 80.00th=[   10], 90.00th=[   12], 95.00th=[   13],
     | 99.00th=[   86], 99.50th=[   92], 99.90th=[  111], 99.95th=[  117],
     | 99.99th=[  135]
   bw (  MiB/s): min= 1232, max= 1242, per=99.99%, avg=1237.24, stdev= 2.43, samples=20
   iops        : min=78894, max=79488, avg=79183.20, stdev=155.25, samples=20
  lat (usec)   : 10=84.02%, 20=12.90%, 50=0.23%, 100=2.60%, 250=0.26%
  lat (usec)   : 750=0.01%, 1000=0.01%
  cpu          : usr=99.98%, sys=0.00%, ctx=4, majf=0, minf=2
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,791911,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1237MiB/s (1297MB/s), 1237MiB/s-1237MiB/s (1297MB/s-1297MB/s), io=12.1GiB (13.0GB), run=10000-10000msec