fio_test_res2_write/1_512b.txt
test: (g=0): rw=randwrite, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=spdk, iodepth=1
fio-3.40-34-g306d8
Starting 1 thread
EAL: No legacy callbacks, legacy socket not created

test: (groupid=0, jobs=1): err= 0: pid=47489: Thu Aug 14 19:46:21 2025
  write: IOPS=130k, BW=63.5MiB/s (66.6MB/s)(635MiB/10001msec); 0 zone resets
    slat (nsec): min=153, max=44314, avg=163.77, stdev=64.60
    clat (usec): min=3, max=773, avg= 7.05, stdev= 6.99
     lat (usec): min=4, max=773, avg= 7.21, stdev= 6.99
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    5], 10.00th=[    5], 20.00th=[    5],
     | 30.00th=[    5], 40.00th=[    6], 50.00th=[    7], 60.00th=[    7],
     | 70.00th=[    8], 80.00th=[    8], 90.00th=[   10], 95.00th=[   11],
     | 99.00th=[   18], 99.50th=[   78], 99.90th=[   96], 99.95th=[  104],
     | 99.99th=[  124]
   bw (  KiB/s): min=63944, max=65927, per=100.00%, avg=65029.35, stdev=378.15, samples=20
   iops        : min=127888, max=131854, avg=130058.90, stdev=756.24, samples=20
  lat (usec)   : 4=0.01%, 10=93.34%, 20=5.76%, 50=0.16%, 100=0.65%
  lat (usec)   : 250=0.07%, 500=0.01%, 750=0.01%, 1000=0.01%
  cpu          : usr=99.96%, sys=0.02%, ctx=4, majf=0, minf=2
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1300589,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=63.5MiB/s (66.6MB/s), 63.5MiB/s-63.5MiB/s (66.6MB/s-66.6MB/s), io=635MiB (666MB), run=10001-10001msec