fio_test_res2_write/1_512k.txt
test: (g=0): rw=randwrite, bs=(R) 512KiB-512KiB, (W) 512KiB-512KiB, (T) 512KiB-512KiB, ioengine=spdk, iodepth=1
fio-3.40-34-g306d8
Starting 1 thread
EAL: No legacy callbacks, legacy socket not created

test: (groupid=0, jobs=1): err= 0: pid=53530: Thu Aug 14 19:47:58 2025
  write: IOPS=4701, BW=2351MiB/s (2465MB/s)(23.0GiB/10001msec); 0 zone resets
    slat (nsec): min=6712, max=52438, avg=14894.84, stdev=3839.81
    clat (usec): min=167, max=941, avg=197.23, stdev=30.91
     lat (usec): min=175, max=961, avg=212.12, stdev=30.87
    clat percentiles (usec):
     |  1.00th=[  169],  5.00th=[  169], 10.00th=[  169], 20.00th=[  169],
     | 30.00th=[  169], 40.00th=[  169], 50.00th=[  200], 60.00th=[  219],
     | 70.00th=[  223], 80.00th=[  227], 90.00th=[  231], 95.00th=[  237],
     | 99.00th=[  253], 99.50th=[  258], 99.90th=[  306], 99.95th=[  363],
     | 99.99th=[  889]
   bw (  MiB/s): min= 2324, max= 2360, per=100.00%, avg=2351.10, stdev= 9.14, samples=20
   iops        : min= 4648, max= 4720, avg=4702.20, stdev=18.28, samples=20
  lat (usec)   : 250=98.48%, 500=1.50%, 1000=0.02%
  cpu          : usr=99.97%, sys=0.00%, ctx=4, majf=0, minf=2
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,47022,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=2351MiB/s (2465MB/s), 2351MiB/s-2351MiB/s (2465MB/s-2465MB/s), io=23.0GiB (24.7GB), run=10001-10001msec