fio_test_res2_write/32_128k.txt
test: (g=0): rw=randwrite, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=spdk, iodepth=32
fio-3.40-34-g306d8
Starting 1 thread
EAL: No legacy callbacks, legacy socket not created

test: (groupid=0, jobs=1): err= 0: pid=66992: Thu Aug 14 19:51:26 2025
  write: IOPS=21.1k, BW=2639MiB/s (2767MB/s)(25.8GiB/10003msec); 0 zone resets
    slat (nsec): min=1484, max=52176, avg=5264.32, stdev=1778.24
    clat (usec): min=45, max=5734, avg=1509.62, stdev=1121.90
     lat (usec): min=47, max=5744, avg=1514.88, stdev=1121.91
    clat percentiles (usec):
     |  1.00th=[   47],  5.00th=[   91], 10.00th=[  141], 20.00th=[  262],
     | 30.00th=[  494], 40.00th=[  889], 50.00th=[ 1450], 60.00th=[ 2008],
     | 70.00th=[ 2376], 80.00th=[ 2638], 90.00th=[ 2999], 95.00th=[ 3228],
     | 99.00th=[ 3720], 99.50th=[ 3916], 99.90th=[ 4490], 99.95th=[ 4752],
     | 99.99th=[ 5407]
   bw (  MiB/s): min=    7, max= 2782, per=95.27%, avg=2513.99, stdev=580.71, samples=21
   iops        : min=   62, max=22258, avg=20111.90, stdev=4645.71, samples=21
  lat (usec)   : 50=1.37%, 100=5.31%, 250=12.77%, 500=10.73%, 750=6.71%
  lat (usec)   : 1000=5.45%
  lat (msec)   : 2=17.57%, 4=39.75%, 10=0.35%
  cpu          : usr=99.96%, sys=0.03%, ctx=4, majf=0, minf=0
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,211175,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=2639MiB/s (2767MB/s), 2639MiB/s-2639MiB/s (2767MB/s-2767MB/s), io=25.8GiB (27.7GB), run=10003-10003msec